"""

1. Выведите на экран элементы словаря с помощью цийла while и блока try/except:

while smth:
    try:
        # do something with element
    except StopIteration:
        # if StopIteration is raised, break from loop
        break

2. Есть пары (('1', 1),('2', 2),('3', 3)). Создайте словарь с помощью генератора словаря.

3. Есть список [{'a': 123, 'b': 1234}, {'a': 3222, 'b': 1234}, {'a': 123, 'b': 1234}]. Удалить дубликаты с помощью
генератора.

4. Декоратор, выводящий время, которое заняло выполнение функции которая создает tuple и на каждой итерации добавляет
в него рандомный элемент от 1 до 100, и так 1000000 раз

"""