"""
https://en.wikipedia.org/wiki/Fibonacci_number
1. Нужно создать кортеж который будет заполнен числами Фибоначчи от 0 до числа которое будет на больше заданного
числа max_value (100). Вывести максимальное значение этого кортежа.

2. Есть список, состоящий из файлов результатов выполнения программы.
a = ['step1.xml', 'step2.xml', 'step1_log.xml', 'step3.xml', 'step2_log.xml']
Погруппировать его в двойки кортежей, если файл log не в списке, его значение может быть None.
Используйте lambda

3. Создать список. С помощью map/filter/reduce вернуть список длин всех его элементов.
Элементы могут быть типа int, None, str

4. дан кортеж a = (1,4,9,12,34,8,3)
Проверить, все ли/хотя бы одно из чисел >0, >12, <6

5. Дано три массива одинаковой длины, все элементы типа int. Создать список с перемноженными
поэлементно значениями (т.е. a=[1,2], b=[10,20], c=[100,200] -> [1000, 8000])
"""
